links.org
#+TITLE: Collection of info regarding security-related info.
#+BEGIN_OPTIONS
#+STARTUP: indent
#+SETUPFILE: theme-readtheorg.setup
#+OPTIONS: toc:2
#+OPTIONS: html-link-use-abs-url:nil html-postamble:auto
#+OPTIONS: html-preamble:t html-scripts:t html-style:t
#+OPTIONS: html5-fancy:nil tex:t
#+HTML_DOCTYPE: xhtml-strict
#+HTML_CONTAINER: div
#+DESCRIPTION: A collection of security and network related links.
#+KEYWORDS: security network hacking
#+HTML_LINK_HOME:
#+HTML_LINK_UP:
#+HTML_MATHJAX:
#+HTML_HEAD:
#+HTML_HEAD_EXTRA:
#+SUBTITLE:
#+INFOJS_OPT:
#+CREATOR: <a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.2.1 (<a href="http://orgmode.org">Org</a> mode 9.1)
#+LATEX_HEADER:
#+END_OPTIONS

* Security stuff
** Scanning
+ http://shodan.io
+ http://censys.io
+ https://scans.io
+ https://www.zoomeye.org/
+ https://observatory.mozilla.org/
+ http://retire.insecurity.today/ Scan for outdated libraries
+ https://www.ssllabs.com/ssltest/ Test server for bad SSL
+ https://dnsdumpster.com/#section3 DNS lookups
+ http://dnscheck.iis.se/ DNS checker
+ http://dnscheck.pingdom.com/ DNS checker
+ https://dnscheck.ripe.net/ Reverse check for domain
+ https://intodns.com/ Test DNS and mail
+ https://dnschecker.org/ DNS propagation test
+ http://www.dnssy.com/ DNS checker
+ https://ichidanv34wrx7m7.onion/ [[https://www.bleepingcomputer.com/news/security/ichidan-is-a-shodan-like-search-engine-for-the-dark-web/][Ichidan search engine]]
** Info about vulnerabilities
+ https://www.cvedetails.com/
** Security Guides
*** SSH
+ [[https://wiki.mozilla.org/Security/Guidelines/OpenSSH][Mozilla Wiki about SSH]]
*** GnuPG (GPG/PGP)
+ https://riseup.net/ru/security/message-security/openpgp/best-practices
+ https://alexcabal.com/creating-the-perfect-gpg-keypair/
*** OpenSSL
+ https://www.madboa.com/geek/openssl/
+ https://letsencrypt.org/
** Logging
+ https://www.graylog.org/
+ https://www.elastic.co/products/beats/packetbeat
** Network
+ https://nmap.org/
+ https://www.bro.org/
+ https://github.com/aol/moloch
+ [[http://www.qosient.com/argus/index.shtml][Argus scanner]]
** Crypto
+ https://keybase.io/
+ https://kryptera.se/
** Incident
+ https://thehive-project.org/
** Malware 
+ https://www.nomoreransom.org/
+ [[https://malware-hunter.shodan.io/][Malwares on Shodan]]
** Detection Tools
- Loki https://github.com/Neo23x0/Loki
** Threat Intelligence
+ Yara https://securityintelligence.com/signature-based-detection-with-yara/
+ STIX
+ TAXII
+ CYBOX
+ [[https://app.cymon.io/][Cymon beta]]
+ [[https://cymon.io/][Open Threat Intelligence - cymon.io]]
+ https://ransomwaretracker.abuse.ch/
+ https://www.virustotal.com/
+ [[https://www.abuseipdb.com/][Abuse IP DB]]
+ [[https://www.dnsdb.info/][DNSDB or FarSight]]
* Other
** Social
+ https://mastodon.social/about
** Info
+ https://www.malwaretech.com/ 
+ https://sans.org/
* Dev
** Sharing
+ https://transfer.sh/
+ https://sprend.com/
** Powershell
+ [[https://peter.hahndorf.eu/blog/WindowsFeatureViaCmd.html][Different ways for installing Windows features on the command line - Peter Hahndorf - peter.hahndorf.eu]]
+ [[https://ss64.com/links/pslinks.html][Windows PowerShell Books Software and Websites - SS64.com]]
+ [[https://www.gitbook.com/@devops-collective-inc][Gitbooks, Powershell]]
+ [[http://powershell.org][Powershell.Org]]
* Network
+ https://www.bleepingcomputer.com/
** Addressing stuff
Including LIR and IPv4, IPv6 addressing.
[[https://www.ripe.net/support/training/material/ripe-ncc-training-material#LIR][RIPE NCC Training Course Material — RIPE Network Coordination Centre - www.ripe.net]]
** IPAM
- [[https://github.com/digitalocean/netbox][digitalocean/netbox: IP address management (IPAM) and data center infrastructure management (DCIM) tool. - github.com]]
- [[https://phpipam.net/][phpIPAM IPAM IP address management software - phpipam.net]]
- [[https://spritelink.github.io/NIPAP/][NIPAP - the best open source IP address management (IPAM) in the known universe - spritelink.github.io]]
- [[http://www.linuxscrew.com/2012/04/04/ip-address-management-software/][Top Open Source IP Address Management Software - LinuxScrew: Linux Blog - www.linuxscrew.com]]
** Devices
- [[http://www.midbittech.com/][Shark tap: midBit Technologies]]
* Collections
** Network security
+ [[https://www.wordfence.com/blog/2017/04/tools-for-security-analysts/][Wordfence sec-tools]]
* Reading
** OS
- [[http://pages.cs.wisc.edu/~remzi/OSTEP/][Ostep.org]]
