links.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-09-15 fre 10:27 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Collection of info regarding security-related info.</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Stig Dahl" />
<meta name="description" content="A collection of security and network related links."
 />
<meta name="keywords" content="security network hacking" />
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Collection of info regarding security-related info.</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga5358bc">1. Security stuff</a>
<ul>
<li><a href="#orgf5d9c69">1.1. Scanning</a></li>
<li><a href="#orgd51e517">1.2. Info about vulnerabilities</a></li>
<li><a href="#orgf9de0fd">1.3. Security Guides</a></li>
<li><a href="#org5239d29">1.4. Logging</a></li>
<li><a href="#org4399311">1.5. Network</a></li>
<li><a href="#org6d89da5">1.6. Crypto</a></li>
<li><a href="#org1f8cecf">1.7. Incident</a></li>
<li><a href="#org82c0b4e">1.8. Malware</a></li>
<li><a href="#orge98f630">1.9. Detection Tools</a></li>
<li><a href="#org25a4659">1.10. Threat Intelligence</a></li>
</ul>
</li>
<li><a href="#org3d06001">2. Other</a>
<ul>
<li><a href="#org879c2a4">2.1. Social</a></li>
<li><a href="#org4b1df81">2.2. Info</a></li>
</ul>
</li>
<li><a href="#org08474e5">3. Dev</a>
<ul>
<li><a href="#org4ee9717">3.1. Sharing</a></li>
<li><a href="#org20466b2">3.2. Powershell</a></li>
</ul>
</li>
<li><a href="#orge8043dc">4. Network</a>
<ul>
<li><a href="#org03b5258">4.1. Addressing stuff</a></li>
<li><a href="#orgd41a447">4.2. IPAM</a></li>
<li><a href="#orgd33f2a4">4.3. Devices</a></li>
</ul>
</li>
<li><a href="#orgba09989">5. Collections</a>
<ul>
<li><a href="#org50585c9">5.1. Network security</a></li>
</ul>
</li>
<li><a href="#orgc2e619c">6. Reading</a>
<ul>
<li><a href="#org15652a7">6.1. OS</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div class="OPTIONS">

</div>

<div id="outline-container-orga5358bc" class="outline-2">
<h2 id="orga5358bc"><span class="section-number-2">1</span> Security stuff</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgf5d9c69" class="outline-3">
<h3 id="orgf5d9c69"><span class="section-number-3">1.1</span> Scanning</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li><a href="http://shodan.io">http://shodan.io</a></li>
<li><a href="http://censys.io">http://censys.io</a></li>
<li><a href="https://scans.io">https://scans.io</a></li>
<li><a href="https://www.zoomeye.org/">https://www.zoomeye.org/</a></li>
<li><a href="https://observatory.mozilla.org/">https://observatory.mozilla.org/</a></li>
<li><a href="http://retire.insecurity.today/">http://retire.insecurity.today/</a> Scan for outdated libraries</li>
<li><a href="https://www.ssllabs.com/ssltest/">https://www.ssllabs.com/ssltest/</a> Test server for bad SSL</li>
<li><a href="https://dnsdumpster.com/#section3">https://dnsdumpster.com/#section3</a> DNS lookups</li>
<li><a href="http://dnscheck.iis.se/">http://dnscheck.iis.se/</a> DNS checker</li>
<li><a href="http://dnscheck.pingdom.com/">http://dnscheck.pingdom.com/</a> DNS checker</li>
<li><a href="https://dnscheck.ripe.net/">https://dnscheck.ripe.net/</a> Reverse check for domain</li>
<li><a href="https://intodns.com/">https://intodns.com/</a> Test DNS and mail</li>
<li><a href="https://dnschecker.org/">https://dnschecker.org/</a> DNS propagation test</li>
<li><a href="http://www.dnssy.com/">http://www.dnssy.com/</a> DNS checker</li>
<li><a href="https://ichidanv34wrx7m7.onion/">https://ichidanv34wrx7m7.onion/</a> <a href="https://www.bleepingcomputer.com/news/security/ichidan-is-a-shodan-like-search-engine-for-the-dark-web/">Ichidan search engine</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgd51e517" class="outline-3">
<h3 id="orgd51e517"><span class="section-number-3">1.2</span> Info about vulnerabilities</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li><a href="https://www.cvedetails.com/">https://www.cvedetails.com/</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgf9de0fd" class="outline-3">
<h3 id="orgf9de0fd"><span class="section-number-3">1.3</span> Security Guides</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-org10f5fb5" class="outline-4">
<h4 id="org10f5fb5"><span class="section-number-4">1.3.1</span> SSH</h4>
<div class="outline-text-4" id="text-1-3-1">
<ul class="org-ul">
<li><a href="https://wiki.mozilla.org/Security/Guidelines/OpenSSH">Mozilla Wiki about SSH</a></li>
</ul>
</div>
</div>
<div id="outline-container-org9d7f4fa" class="outline-4">
<h4 id="org9d7f4fa"><span class="section-number-4">1.3.2</span> GnuPG (GPG/PGP)</h4>
<div class="outline-text-4" id="text-1-3-2">
<ul class="org-ul">
<li><a href="https://riseup.net/ru/security/message-security/openpgp/best-practices">https://riseup.net/ru/security/message-security/openpgp/best-practices</a></li>
<li><a href="https://alexcabal.com/creating-the-perfect-gpg-keypair/">https://alexcabal.com/creating-the-perfect-gpg-keypair/</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgcd2bc69" class="outline-4">
<h4 id="orgcd2bc69"><span class="section-number-4">1.3.3</span> OpenSSL</h4>
<div class="outline-text-4" id="text-1-3-3">
<ul class="org-ul">
<li><a href="https://www.madboa.com/geek/openssl/">https://www.madboa.com/geek/openssl/</a></li>
<li><a href="https://letsencrypt.org/">https://letsencrypt.org/</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org5239d29" class="outline-3">
<h3 id="org5239d29"><span class="section-number-3">1.4</span> Logging</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li><a href="https://www.graylog.org/">https://www.graylog.org/</a></li>
<li><a href="https://www.elastic.co/products/beats/packetbeat">https://www.elastic.co/products/beats/packetbeat</a></li>
</ul>
</div>
</div>
<div id="outline-container-org4399311" class="outline-3">
<h3 id="org4399311"><span class="section-number-3">1.5</span> Network</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li><a href="https://nmap.org/">https://nmap.org/</a></li>
<li><a href="https://www.bro.org/">https://www.bro.org/</a></li>
<li><a href="https://github.com/aol/moloch">https://github.com/aol/moloch</a></li>
<li><a href="http://www.qosient.com/argus/index.shtml">Argus scanner</a></li>
</ul>
</div>
</div>
<div id="outline-container-org6d89da5" class="outline-3">
<h3 id="org6d89da5"><span class="section-number-3">1.6</span> Crypto</h3>
<div class="outline-text-3" id="text-1-6">
<ul class="org-ul">
<li><a href="https://keybase.io/">https://keybase.io/</a></li>
<li><a href="https://kryptera.se/">https://kryptera.se/</a></li>
</ul>
</div>
</div>
<div id="outline-container-org1f8cecf" class="outline-3">
<h3 id="org1f8cecf"><span class="section-number-3">1.7</span> Incident</h3>
<div class="outline-text-3" id="text-1-7">
<ul class="org-ul">
<li><a href="https://thehive-project.org/">https://thehive-project.org/</a></li>
</ul>
</div>
</div>
<div id="outline-container-org82c0b4e" class="outline-3">
<h3 id="org82c0b4e"><span class="section-number-3">1.8</span> Malware</h3>
<div class="outline-text-3" id="text-1-8">
<ul class="org-ul">
<li><a href="https://www.nomoreransom.org/">https://www.nomoreransom.org/</a></li>
<li><a href="https://malware-hunter.shodan.io/">Malwares on Shodan</a></li>
</ul>
</div>
</div>
<div id="outline-container-orge98f630" class="outline-3">
<h3 id="orge98f630"><span class="section-number-3">1.9</span> Detection Tools</h3>
<div class="outline-text-3" id="text-1-9">
<ul class="org-ul">
<li>Loki <a href="https://github.com/Neo23x0/Loki">https://github.com/Neo23x0/Loki</a></li>
</ul>
</div>
</div>
<div id="outline-container-org25a4659" class="outline-3">
<h3 id="org25a4659"><span class="section-number-3">1.10</span> Threat Intelligence</h3>
<div class="outline-text-3" id="text-1-10">
<ul class="org-ul">
<li>Yara <a href="https://securityintelligence.com/signature-based-detection-with-yara/">https://securityintelligence.com/signature-based-detection-with-yara/</a></li>
<li>STIX</li>
<li>TAXII</li>
<li>CYBOX</li>
<li><a href="https://app.cymon.io/">Cymon beta</a></li>
<li><a href="https://cymon.io/">Open Threat Intelligence - cymon.io</a></li>
<li><a href="https://ransomwaretracker.abuse.ch/">https://ransomwaretracker.abuse.ch/</a></li>
<li><a href="https://www.virustotal.com/">https://www.virustotal.com/</a></li>
<li><a href="https://www.abuseipdb.com/">Abuse IP DB</a></li>
<li><a href="https://www.dnsdb.info/">DNSDB or FarSight</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org3d06001" class="outline-2">
<h2 id="org3d06001"><span class="section-number-2">2</span> Other</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org879c2a4" class="outline-3">
<h3 id="org879c2a4"><span class="section-number-3">2.1</span> Social</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li><a href="https://mastodon.social/about">https://mastodon.social/about</a></li>
</ul>
</div>
</div>
<div id="outline-container-org4b1df81" class="outline-3">
<h3 id="org4b1df81"><span class="section-number-3">2.2</span> Info</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li><a href="https://www.malwaretech.com/">https://www.malwaretech.com/</a></li>
<li><a href="https://sans.org/">https://sans.org/</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org08474e5" class="outline-2">
<h2 id="org08474e5"><span class="section-number-2">3</span> Dev</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org4ee9717" class="outline-3">
<h3 id="org4ee9717"><span class="section-number-3">3.1</span> Sharing</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li><a href="https://transfer.sh/">https://transfer.sh/</a></li>
<li><a href="https://sprend.com/">https://sprend.com/</a></li>
</ul>
</div>
</div>
<div id="outline-container-org20466b2" class="outline-3">
<h3 id="org20466b2"><span class="section-number-3">3.2</span> Powershell</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li><a href="https://peter.hahndorf.eu/blog/WindowsFeatureViaCmd.html">Different ways for installing Windows features on the command line - Peter Hahndorf - peter.hahndorf.eu</a></li>
<li><a href="https://ss64.com/links/pslinks.html">Windows PowerShell Books Software and Websites - SS64.com</a></li>
<li><a href="https://www.gitbook.com/@devops-collective-inc">Gitbooks, Powershell</a></li>
<li><a href="http://powershell.org">Powershell.Org</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orge8043dc" class="outline-2">
<h2 id="orge8043dc"><span class="section-number-2">4</span> Network</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li><a href="https://www.bleepingcomputer.com/">https://www.bleepingcomputer.com/</a></li>
</ul>
</div>
<div id="outline-container-org03b5258" class="outline-3">
<h3 id="org03b5258"><span class="section-number-3">4.1</span> Addressing stuff</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Including LIR and IPv4, IPv6 addressing.
<a href="https://www.ripe.net/support/training/material/ripe-ncc-training-material#LIR">RIPE NCC Training Course Material — RIPE Network Coordination Centre - www.ripe.net</a>
</p>
</div>
</div>
<div id="outline-container-orgd41a447" class="outline-3">
<h3 id="orgd41a447"><span class="section-number-3">4.2</span> IPAM</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li><a href="https://github.com/digitalocean/netbox">digitalocean/netbox: IP address management (IPAM) and data center infrastructure management (DCIM) tool. - github.com</a></li>
<li><a href="https://phpipam.net/">phpIPAM IPAM IP address management software - phpipam.net</a></li>
<li><a href="https://spritelink.github.io/NIPAP/">NIPAP - the best open source IP address management (IPAM) in the known universe - spritelink.github.io</a></li>
<li><a href="http://www.linuxscrew.com/2012/04/04/ip-address-management-software/">Top Open Source IP Address Management Software - LinuxScrew: Linux Blog - www.linuxscrew.com</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgd33f2a4" class="outline-3">
<h3 id="orgd33f2a4"><span class="section-number-3">4.3</span> Devices</h3>
<div class="outline-text-3" id="text-4-3">
<ul class="org-ul">
<li><a href="http://www.midbittech.com/">Shark tap: midBit Technologies</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgba09989" class="outline-2">
<h2 id="orgba09989"><span class="section-number-2">5</span> Collections</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org50585c9" class="outline-3">
<h3 id="org50585c9"><span class="section-number-3">5.1</span> Network security</h3>
<div class="outline-text-3" id="text-5-1">
<ul class="org-ul">
<li><a href="https://www.wordfence.com/blog/2017/04/tools-for-security-analysts/">Wordfence sec-tools</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgc2e619c" class="outline-2">
<h2 id="orgc2e619c"><span class="section-number-2">6</span> Reading</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org15652a7" class="outline-3">
<h3 id="org15652a7"><span class="section-number-3">6.1</span> OS</h3>
<div class="outline-text-3" id="text-6-1">
<ul class="org-ul">
<li><a href="http://pages.cs.wisc.edu/~remzi/OSTEP/">Ostep.org</a></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Stig Dahl</p>
<p class="date">Created: 2017-09-15 fre 10:27</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
