links.md
- [Security stuff](#orgd509c0c)
  - [Scanning](#orgabc396d)
  - [Info about vulnerabilities](#orgb7f3f3e)
  - [Security Guides](#org9b8a0c4)
  - [Logging](#org078cab9)
  - [Network](#orgf28bf95)
  - [Crypto](#org894dea1)
  - [Incident](#org466f413)
  - [Malware](#org7acd430)
  - [Detection Tools](#org1d66135)
  - [Threat Intelligence](#org76bc866)
- [Other](#org956c353)
  - [Social](#orgdb5fddf)
  - [Info](#org99cabf3)
- [Dev](#org99b1626)
  - [Sharing](#org9142538)
  - [Powershell](#org5463822)
- [Network](#org78ca6d6)
  - [Addressing stuff](#orgfd8595c)
  - [IPAM](#orgeb65f69)
  - [Devices](#orge87dfd7)
- [Collections](#orge20bb20)
  - [Network security](#orgb3e45fa)
- [Reading](#org418c36e)
  - [OS](#orgc46ecef)

<div class="OPTIONS">

</div>


<a id="orgd509c0c"></a>

# Security stuff


<a id="orgabc396d"></a>

## Scanning

-   <http://shodan.io>
-   <http://censys.io>
-   <https://scans.io>
-   <https://www.zoomeye.org/>
-   <https://observatory.mozilla.org/>
-   <http://retire.insecurity.today/> Scan for outdated libraries
-   <https://www.ssllabs.com/ssltest/> Test server for bad SSL
-   <https://dnsdumpster.com/#section3> DNS lookups
-   <http://dnscheck.iis.se/> DNS checker
-   <http://dnscheck.pingdom.com/> DNS checker
-   <https://dnscheck.ripe.net/> Reverse check for domain
-   <https://intodns.com/> Test DNS and mail
-   <https://dnschecker.org/> DNS propagation test
-   <http://www.dnssy.com/> DNS checker
-   <https://ichidanv34wrx7m7.onion/> [Ichidan search engine](https://www.bleepingcomputer.com/news/security/ichidan-is-a-shodan-like-search-engine-for-the-dark-web/)


<a id="orgb7f3f3e"></a>

## Info about vulnerabilities

-   <https://www.cvedetails.com/>


<a id="org9b8a0c4"></a>

## Security Guides


### SSH

-   [Mozilla Wiki about SSH](https://wiki.mozilla.org/Security/Guidelines/OpenSSH)


### GnuPG (GPG/PGP)

-   <https://riseup.net/ru/security/message-security/openpgp/best-practices>
-   <https://alexcabal.com/creating-the-perfect-gpg-keypair/>


### OpenSSL

-   <https://www.madboa.com/geek/openssl/>
-   <https://letsencrypt.org/>


<a id="org078cab9"></a>

## Logging

-   <https://www.graylog.org/>
-   <https://www.elastic.co/products/beats/packetbeat>


<a id="orgf28bf95"></a>

## Network

-   <https://nmap.org/>
-   <https://www.bro.org/>
-   <https://github.com/aol/moloch>
-   [Argus scanner](http://www.qosient.com/argus/index.shtml)
-   <http://ipv4info.com/>


<a id="org894dea1"></a>

## Crypto

-   <https://keybase.io/>
-   <https://kryptera.se/>


<a id="org466f413"></a>

## Incident

-   <https://thehive-project.org/>


<a id="org7acd430"></a>

## Malware

-   <https://www.nomoreransom.org/>
-   [Malwares on Shodan](https://malware-hunter.shodan.io/)


<a id="org1d66135"></a>

## Detection Tools

-   Loki <https://github.com/Neo23x0/Loki>


<a id="org76bc866"></a>

## Threat Intelligence

-   Yara <https://securityintelligence.com/signature-based-detection-with-yara/>
-   STIX
-   TAXII
-   CYBOX
-   [Cymon beta](https://app.cymon.io/)
-   [Open Threat Intelligence - cymon.io](https://cymon.io/)
-   <https://ransomwaretracker.abuse.ch/>
-   <https://www.virustotal.com/>
-   [Abuse IP DB](https://www.abuseipdb.com/)
-   [DNSDB or FarSight](https://www.dnsdb.info/)


<a id="org956c353"></a>

# Other


<a id="orgdb5fddf"></a>

## Social

-   <https://mastodon.social/about>


<a id="org99cabf3"></a>

## Info

-   <https://www.malwaretech.com/>
-   <https://sans.org/>


<a id="org99b1626"></a>

# Dev


<a id="org9142538"></a>

## Sharing

-   <https://transfer.sh/>
-   <https://sprend.com/>


<a id="org5463822"></a>

## Powershell

-   [Different ways for installing Windows features on the command line - Peter Hahndorf - peter.hahndorf.eu](https://peter.hahndorf.eu/blog/WindowsFeatureViaCmd.html)
-   [Windows PowerShell Books Software and Websites - SS64.com](https://ss64.com/links/pslinks.html)
-   [Gitbooks, Powershell](https://www.gitbook.com/@devops-collective-inc)
-   [Powershell.Org](http://powershell.org)


<a id="org78ca6d6"></a>

# Network

-   <https://www.bleepingcomputer.com/>


<a id="orgfd8595c"></a>

## Addressing stuff

Including LIR and IPv4, IPv6 addressing. [RIPE NCC Training Course Material — RIPE Network Coordination Centre - www.ripe.net](https://www.ripe.net/support/training/material/ripe-ncc-training-material#LIR)


<a id="orgeb65f69"></a>

## IPAM

-   [digitalocean/netbox: IP address management (IPAM) and data center infrastructure management (DCIM) tool. - github.com](https://github.com/digitalocean/netbox)
-   [phpIPAM IPAM IP address management software - phpipam.net](https://phpipam.net/)
-   [NIPAP - the best open source IP address management (IPAM) in the known universe - spritelink.github.io](https://spritelink.github.io/NIPAP/)
-   [Top Open Source IP Address Management Software - LinuxScrew: Linux Blog - www.linuxscrew.com](http://www.linuxscrew.com/2012/04/04/ip-address-management-software/)


<a id="orge87dfd7"></a>

## Devices

-   [Shark tap: midBit Technologies](http://www.midbittech.com/)


<a id="orge20bb20"></a>

# Collections


<a id="orgb3e45fa"></a>

## Network security

-   [Wordfence sec-tools](https://www.wordfence.com/blog/2017/04/tools-for-security-analysts/)


<a id="org418c36e"></a>

# Reading


<a id="orgc46ecef"></a>

## OS

-   [Ostep.org](http://pages.cs.wisc.edu/~remzi/OSTEP/)
